Autodesk.Revit.Exceptions.DefaultValueException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.DefaultValueException
The exception thrown when Revit cannot initialize a default value for a family parameter.
Since: 2024